{
	"nav": {
		"contact": "Contacto",
		"projects": "Proyectos",
		"techStack": "Stack tecnológico"
	},
	"personal": {
		"name": "Enrique Sanchez Sandoval",
		"title": "Fullstack Developer",
		"bio": "Desarrollador fullstack con enfoque en frontend. Estudio Ingeniería en Desarrollo de Software y he trabajado en proyectos integrales con React y Node.js. Me mantengo en constante actualización mediante plataformas como Platzi y Udemy."
	},
	"services": {
		"heading": "Tecnologías y herramientas",
		"items": [
			"Desarrollo de interfaces modernas con React y TypeScript.",
			"Implementación de arquitecturas escalables y mantenibles (Clean Architecture).",
			"Integración con APIs RESTful usando Node.js.",
			"Optimización y mantenimiento de aplicaciones existentes.",
			"Despliegue y gestión en entornos cloud."
		]
	},
	"projects": {
		"booking": {
			"title": "Booking Platform Project",
			"description": "Sistema web de reservas desarrollado con Next.js, TypeScript, Supabase y Stripe, diseñado para gestionar búsquedas de alojamientos, disponibilidad de habitaciones y procesamiento de pagos. La aplicación implementa un flujo completo de reservas, integración con Stripe Checkout y manejo de webhooks para asegurar consistencia transaccional entre el estado del pago y la confirmación de la reserva. Incluye control de disponibilidad, validación de reglas de negocio y preparación para integración con pagos reales. El proyecto está en modo demo, pero cuenta con arquitectura preparada para producción."
		},
		"github": {
			"title": "Search GitHub",
			"description": "Aplicación web desarrollada con React, Webpack y Material UI que permite consultar información de perfiles de GitHub como número de repositorios, seguidores y seguidos. Ideal como herramienta de análisis o referencia para equipos de desarrollo o reclutamiento técnico. Este proyecto muestra mi capacidad para consumir APIs públicas y presentar datos de forma clara y visualmente atractiva."
		}
	},
	"contact": {
		"heading": "Contactáme"
	},
	"pageTitle": "Portafolio de Enrique"
}
